using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

//Реализовать базу данных игроков и методы для работы с ней. Должно быть консольное меню для взаимодействия пользователя с возможностями базы данных.
//Игрок должен состоять из уникального номера, ника, уровня и булевого значения, забанен ли игрок.
//Реализовать возможность добавления игрока, бана игрока по уникальному номеру, разбана игрока по уникальному номеру и удаление игрока по уникальному номеру.

//Создавать полноценные системы баз данных не нужно, задание выполняется инструментами, которые вы уже изучили в рамках курса. Надо сделать класс "База данных".

namespace players_data_base
{
    internal class Program
    {
        static void Main(string[] args)
        {
        }
    }

    class DataBase
    {
        
    }
}
